OpenFoam_Cases/Channel_13350_M2/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
24000
(
(0.025 0.00126537 0)
(0.075 0.00126537 0)
(0.125 0.00126537 0)
(0.175 0.00126537 1.49094e-18)
(0.225 0.00126537 -9.63735e-20)
(0.275 0.00126537 0)
(0.325 0.00126537 -9.63735e-20)
(0.375 0.00126537 0)
...
)
;

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(0.025 0 0)
(0.075 0 0)
(0.125 0 0)
(0.175 0 0)
(0.225 0 0)
(0.275 0 0)
(0.325 0 0)
(0.375 0 0)
...
)
;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(0.025 2 0)
(0.075 2 0)
(0.125 2 0)
(0.175 2 0)
(0.225 2 0)
(0.275 2 0)
(0.325 2 0)
(0.375 2 0)
...
)
;
    }
    sides1_half0
    {
        type            cyclic;
    }
    sides1_half1
    {
        type            cyclic;
    }
    sides2_half0
    {
        type            cyclic;
    }
    sides2_half1
    {
        type            cyclic;
    }
    inout1_half0
    {
        type            cyclic;
    }
    inout1_half1
    {
        type            cyclic;
    }
    inout2_half0
    {
        type            cyclic;
    }
    inout2_half1
    {
        type            cyclic;
    }
}


// ************************************************************************* //
