OpenFoam_Cases/Channel_13350_M2/0/Cy
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
24000
(
0.00126537
0.00126537
0.00126537
0.00126537
0.00126537
0.00126537
0.00126537
0.00126537
...
)
;

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           uniform 0;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
120
(
2
2
2
2
2
2
2
2
...
)
;
    }
    sides1_half0
    {
        type            cyclic;
    }
    sides1_half1
    {
        type            cyclic;
    }
    sides2_half0
    {
        type            cyclic;
    }
    sides2_half1
    {
        type            cyclic;
    }
    inout1_half0
    {
        type            cyclic;
    }
    inout1_half1
    {
        type            cyclic;
    }
    inout2_half0
    {
        type            cyclic;
    }
    inout2_half1
    {
        type            cyclic;
    }
}


// ************************************************************************* //
