OpenFoam_Cases/Channel_13350_M2/0/wallShearStress
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      wallShearStress;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(-0.00137463 0 0)
(-0.00137463 0 0)
(-0.00137463 0 0)
(-0.00137463 0 0)
(-0.00137463 0 0)
(-0.00137463 0 0)
(-0.00137463 0 0)
(-0.00137463 0 0)
...
)
;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(-0.00136533 4.62016e-21 0)
(-0.00136533 0 0)
(-0.00136533 0 0)
(-0.00136533 0 0)
(-0.00136533 0 0)
(-0.00136533 0 0)
(-0.00136533 0 0)
(-0.00136533 0 0)
...
)
;
    }
    sides1_half0
    {
        type            cyclic;
    }
    sides1_half1
    {
        type            cyclic;
    }
    sides2_half0
    {
        type            cyclic;
    }
    sides2_half1
    {
        type            cyclic;
    }
    inout1_half0
    {
        type            cyclic;
    }
    inout1_half1
    {
        type            cyclic;
    }
    inout2_half0
    {
        type            cyclic;
    }
    inout2_half1
    {
        type            cyclic;
    }
}


// ************************************************************************* //
